org/Whitehead's_philosophy_points_of_connection_edited_by_Polanowski_and_Sherburne_in_2004.org
#+setupfile: ./hugo_setup.org
#+hugo_slug: Whitehead's_philosophy_points_of_connection_edited_by_Polanowski_and_Sherburne_in_2004
#+TITLE: Whitehead's philosophy points of connection edited by Polanowski and Sherburne in 2004
* I. An introductory essay
** 1. Whitehead, Descartes, and Terminology by Donald Sherburne
* II. Whitehead and classical American philosophy
** 2. Whitehead and pragmatism by Robert Neville
*** pragmatism and process philosophy, especially in the early years, worked the same side of the street, defending
**** realism against idealism
**** realism in the other sense against nominalism
**** the importance of experience in a broader sense than British empiricism,5
**** the possibility of metaphysics in the grand tradition though in revolutionary forms critical of the tradition,6
**** the importance of philosophy for public life rather than as an academic subject alone (as it tended to be on British, German, and French models of philosophy),7
**** the meaning of truth as correspondence
**** the criteria of truth as pragmatic (some pragmatists are more careful with this distinction than others),9
**** fallibilism and the method of hypothesis over against foundationalism,10
**** all of the above in considerable self-conscious cooperation over against both Anglo-American analytic philosophy and Continental philosophy which were dominant in the English* speaking academic world throughout the last two-thirds of the twentieth century, with the result that pragmatism and process philosophy together were marginalized in academic philosophy from the 1960s onward.
