content/posts/Whitehead's_philosophy_points_of_connection_edited_by_Polanowski_and_Sherburne_in_2004.md
+++
title = "Whitehead's philosophy points of connection edited by Polanowski and Sherburne in 2004"
author = ["Cameron Smith"]
lastmod = 2020-09-20T17:36:27-04:00
slug = "Whitehead's_philosophy_points_of_connection_edited_by_Polanowski_and_Sherburne_in_2004"
draft = false
+++

## I. An introductory essay {#i-dot-an-introductory-essay}


### 1. Whitehead, Descartes, and Terminology by Donald Sherburne {#1-dot-whitehead-descartes-and-terminology-by-donald-sherburne}


## II. Whitehead and classical American philosophy {#ii-dot-whitehead-and-classical-american-philosophy}


### 2. Whitehead and pragmatism by Robert Neville {#2-dot-whitehead-and-pragmatism-by-robert-neville}

<!--list-separator-->

-  pragmatism and process philosophy, especially in the early years, worked the same side of the street, defending

    <!--list-separator-->

    -  realism against idealism

    <!--list-separator-->

    -  realism in the other sense against nominalism

    <!--list-separator-->

    -  the importance of experience in a broader sense than British empiricism,5

    <!--list-separator-->

    -  the possibility of metaphysics in the grand tradition though in revolutionary forms critical of the tradition,6

    <!--list-separator-->

    -  the importance of philosophy for public life rather than as an academic subject alone (as it tended to be on British, German, and French models of philosophy),7

    <!--list-separator-->

    -  the meaning of truth as correspondence

    <!--list-separator-->

    -  the criteria of truth as pragmatic (some pragmatists are more careful with this distinction than others),9

    <!--list-separator-->

    -  fallibilism and the method of hypothesis over against foundationalism,10

    <!--list-separator-->

    -  all of the above in considerable self-conscious cooperation over against both Anglo-American analytic philosophy and Continental philosophy which were dominant in the English\* speaking academic world throughout the last two-thirds of the twentieth century, with the result that pragmatism and process philosophy together were marginalized in academic philosophy from the 1960s onward.
